---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SheetCurrentRevisionDescription
source: html/8f2f8663-e5d1-3fd8-73ca-a8c40b5f21a4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SheetCurrentRevisionDescription Property

"Current Revision Description"

## Syntax (C#)
```csharp
public static ForgeTypeId SheetCurrentRevisionDescription { get; }
```